# Dotfiles Brewfile (Curated)
#
# Maintenance workflow:
# 1) Refresh baseline: brew bundle dump --file=/Users/dom/.dotfiles/Brewfile --force
# 2) Re-curate to keep only intentionally used tools.

# --- Taps --------------------------------------------------------------------
tap "cmacrae/formulae"
tap "felixkratz/formulae"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "microsoft/git"
tap "mopidy/mopidy"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "romkatv/powerlevel10k"
tap "zegervdv/zathura"

# --- Shell / CLI -------------------------------------------------------------
brew "atuin"
brew "bat"
brew "diff-so-fancy"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "glow"
brew "htop"
brew "jq"
brew "lolcat"
brew "neofetch"
brew "nushell"
brew "starship"
brew "tmux"
brew "trash", link: true
brew "tty-clock"
brew "zoxide"
brew "zsh-completions"

# --- Developer Toolchain -----------------------------------------------------
brew "automake"
brew "cocoapods"
brew "gemini-cli"
brew "gh"
brew "go"
brew "lazygit"
brew "lua@5.1"
brew "luarocks"
brew "make"
brew "meson"
brew "php"
brew "pipx"
brew "pnpm"
brew "pygobject3"
brew "python-setuptools"
brew "python@3.9"
brew "qt"
brew "resvg"
brew "rust"
brew "rustup"
brew "scipy"
brew "sevenzip"
brew "sphinx-doc"
brew "watchman"
brew "yarn"

# --- Editors / Navigation / Docs ---------------------------------------------
brew "hugo"
brew "lynx"
brew "macvim"
brew "pandoc"
brew "pngpaste"
brew "ranger"
brew "sc-im"
brew "vifm"
brew "w3m"
brew "yazi"
brew "youtube-dl"

# --- Mail / Sync / Secrets ---------------------------------------------------
brew "isync"
brew "msmtp"
brew "notmuch"
brew "pass"

# --- Media / Audio -----------------------------------------------------------
brew "cava"
brew "cmatrix"
brew "ffmpeg"
brew "libdvdcss"
brew "libgsf"
brew "libsoup"
brew "mopidy/mopidy/libspotify"
brew "mpc"
brew "ncmpcpp"
brew "pipes-sh"
brew "spotify-tui"
brew "spotify_player"
brew "switchaudio-osx"
brew "vips"

# --- Windowing / Bar / Desktop -----------------------------------------------
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "nowplaying-cli"
brew "powerlevel10k"

# --- PDF ---------------------------------------------------------------------
brew "zegervdv/zathura/zathura-pdf-mupdf"
brew "zegervdv/zathura/zathura-pdf-poppler"

# --- Desktop Apps ------------------------------------------------------------
cask "nikitabobko/tap/aerospace"
cask "claude-code"
cask "codex"
cask "ghostty"
cask "obsidian"
cask "raycast"

# --- Desktop Utilities -------------------------------------------------------
cask "background-music"
cask "git-credential-manager"
cask "jordanbaird-ice"
cask "mactex-no-gui"
cask "monitorcontrol"
cask "sf-symbols"
cask "stats"

# --- Editors / Fonts ---------------------------------------------------------
cask "emacs-app"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
cask "neovide-app"

# --- Network -----------------------------------------------------------------
cask "ngrok"

# --- Language Package Managers -----------------------------------------------
go "github.com/jackyzha0/hugo-obsidian"

cargo "basalt-tui"
cargo "cargo-bundle"
cargo "fd-find"
cargo "ripgrep"
