[
  "obsidian-admonition",
  "obsidian-vimrc-support",
  "obsidian-minimal-settings",
  "templater-obsidian",
  "quickadd",
  "obsidian-code-copy",
  "obsidian-style-settings",
  "calendar",
  "iconic",
  "ninja-cursor",
  "widgets",
  "heatmap-calendar"
]